Revit 2027 API
FolderItemInfo.GetGroupingParameterIdPath Method
 The parameter Id path used to determine the folder items in the browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetGroupingParameterIdPath()
Public Function GetGroupingParameterIdPath As IList(Of ElementId)
public:
IList<ElementId^>^ GetGroupingParameterIdPath()
member GetGroupingParameterIdPath : unit -> IList<ElementId>
Return Value
IList<ElementId>
Remarks
 A parameter Id path consists of reference parameter Id(s) {0...n} + paramId, and the value of the last parameter in the path is the one that is used to determine the folder items in the browser. Reference parameter is ElementId valued parameter used to retrieve related element, its parameter value is the related element Id. Given an Element, get the value of reference parameter and use the ElementId value to retrieve the referenced element. Each paramId in the path except for the last one is a reference parameter pointing to the next element. Recursively get next element through element obtained in the previous round with the next paramId in the path, finally get the value of the last parameter.
See Also
Reference
FolderItemInfo Class
Autodesk.Revit.DB Namespace